In [1]:
import pandas as pd

In [2]:

a=pd.read_csv("D:\\task1.csv",skiprows=4)

In [3]:
a_2022=a[["Country Name","2022"]]

In [4]:
a_2022

                    Country Name         2022
0                          Aruba     107310.0
1    Africa Eastern and Southern  731821393.0
2                    Afghanistan   40578842.0
3     Africa Western and Central  497387180.0
4                         Angola   35635029.0
..                           ...          ...
261                       Kosovo    1768096.0
262                  Yemen, Rep.   38222876.0
263                 South Africa   62378410.0
264                       Zambia   20152938.0
265                     Zimbabwe   16069056.0

[266 rows x 2 columns]

In [5]:
a_2022.isnull()

     Country Name   2022
0           False  False
1           False  False
2           False  False
3           False  False
4           False  False
..            ...    ...
261         False  False
262         False  False
263         False  False
264         False  False
265         False  False

[266 rows x 2 columns]

In [10]:
a_2022.dropna().sum()

Country Name    ArubaAfrica Eastern and SouthernAfghanistanAfr...
2022                                                86148674478.0
dtype: object

In [9]:
a_2022.duplicated().sum()

np.int64(0)

In [8]:
a_2022.to_csv("population_2022_clean.csv",index=False)